Revit 2026 API

# MassInstanceUtilsGetGrossFloorArea Method

---

Get the total occupiable floor area represented by a mass instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static double GetGrossFloorArea(
	Document document,
	ElementId massInstanceId
)
```
```vb
Public Shared Function GetGrossFloorArea (
	document As Document,
	massInstanceId As ElementId
) As Double
```
```cpp
public:
static double GetGrossFloorArea(
	Document^ document,
	ElementId^ massInstanceId
)
```
```fsharp
static member GetGrossFloorArea :
        document : Document *
        massInstanceId : ElementId -> float
```

#### Parameters

document Document
     The Document.
massInstanceId ElementId
     The ElementId of the mass instance.

#### Return Value

Double The gross floor area in square feet.

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId massInstanceId is not a mass instance. |
| ArgumentNullException | A non-optional argument was null |

The area is computed from the cross sections that are created by intersecting the associated Levels with the mass instance Geometry.

#### Reference

MassInstanceUtils Class

Autodesk.Revit.DB Namespace